In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\acer\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\acer\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\acer\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [1]:
import pandas as pd

In [3]:
data = {'Sqft': [500,750,300,450], 'Price': [25000,37500, 15000, 22500]}
housing = pd.DataFrame(data)
housing

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500

In [5]:
housing = pd.DataFrame(data, index = ['H001', 'H002', 'H003', 'H004'])
housing

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [6]:
housing.loc['H003']

Sqft       300
Price    15000
Name: H003, dtype: int64

In [7]:
housing.loc['H001':'H003']

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000

In [8]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, H001 to H004
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sqft    4 non-null      int64
 1   Price   4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

In [9]:
housing.shape

(4, 2)

In [18]:
housing = pd.concat([housing, pd.DataFrame([{'Sqft': 400, 'Price': 25000}])], ignore_index=True)
housing

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000
5   400  25000
6   400  25000
7   400  25000
8   400  25000

In [21]:
add_housing = pd.concat([housing, pd.DataFrame(housing)], ignore_index=True)
add_housing

    Sqft  Price
0    500  25000
1    750  37500
2    300  15000
3    450  22500
4    400  25000
5    400  25000
6    400  25000
7    400  25000
8    400  25000
9    500  25000
10   750  37500
11   300  15000
12   450  22500
13   400  25000
14   400  25000
15   400  25000
16   400  25000
17   400  25000

In [22]:
housing.describe()

             Sqft         Price
count    9.000000      9.000000
mean   444.444444  25000.000000
std    126.106216   5728.219619
min    300.000000  15000.000000
25%    400.000000  25000.000000
50%    400.000000  25000.000000
75%    450.000000  25000.000000
max    750.000000  37500.000000

In [23]:
add_housing.head()

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000

In [24]:
add_housing.head(7)

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000
5   400  25000
6   400  25000

In [25]:
add_housing.tail()

    Sqft  Price
13   400  25000
14   400  25000
15   400  25000
16   400  25000
17   400  25000

In [26]:
housing.columns

Index(['Sqft', 'Price'], dtype='object')

In [28]:
housing.rename(columns = {'Sqft':'sqft', 'Price':'price'}, inplace=True)
housing

   sqft  price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000
5   400  25000
6   400  25000
7   400  25000
8   400  25000

In [30]:
housing.columns = ['size','$']
housing

   size      $
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000
5   400  25000
6   400  25000
7   400  25000
8   400  25000

## Reading Data

In [33]:
df = pd.read_csv('nextTestFile.csv')
df

        Name   Department  Salary
0    Win Win  Engineering  500000
1      Ag Ag      Finance  350000
2      Ni Ni           HR  300000
3  Kyaw Kyaw      Finance  350000
4      Bo Bo           HR  300000

In [32]:
df = pd.read_csv('nextTestFile.csv', index_col=0)
df

            Department  Salary
Name
Win Win    Engineering  500000
Ag Ag          Finance  350000
Ni Ni               HR  300000
Kyaw Kyaw      Finance  350000
Bo Bo               HR  300000

In [37]:
jdf = pd.read_json('JsonFile.json')
jdf

        Name   Department  Salary
0    Win Win  Engineering  250000
1  Sein Sein           IT  300000
2  Aung Aung      Finance  200000
3      Ni Ni           HR  150000
4   Maung Ba      Finance  205000
5  Maung Hla           HR  155000

In [2]:
import sqlite3 as sql

In [3]:
conn = sql.connect('abc_ltd.db')
conn

In [16]:
ddf = pd.read_sql_query('SELECT * FROM employee', conn)
ddf

   id       name   department  salary
0   1    Win Win  Engineering  250000
1   2  Sein Sein           IT  300000
2   3  Aung Aung      Finance  200000
3   4      Ni Ni           HR  150000
4   5   Maung Ba      Finance  205000
5   6  Maung Hla           HR  150000
6   7     Ko Ko            IT  250000

In [17]:
ddf.set_index('id', inplace=True)
ddf

         name   department  salary
id
1     Win Win  Engineering  250000
2   Sein Sein           IT  300000
3   Aung Aung      Finance  200000
4       Ni Ni           HR  150000
5    Maung Ba      Finance  205000
6   Maung Hla           HR  150000
7      Ko Ko            IT  250000

In [18]:
ddf = ddf.reset_index()
ddf

   id       name   department  salary
0   1    Win Win  Engineering  250000
1   2  Sein Sein           IT  300000
2   3  Aung Aung      Finance  200000
3   4      Ni Ni           HR  150000
4   5   Maung Ba      Finance  205000
5   6  Maung Hla           HR  150000
6   7     Ko Ko            IT  250000

In [30]:
new_row = pd.DataFrame([{'id': 8, 'name': 'Su Su', 'department': 'Management', 'salary': 500000}])
ddf = pd.concat([ddf, new_row], ignore_index=True)
ddf

   id       name   department  salary
0   1    Win Win  Engineering  250000
1   2  Sein Sein           IT  300000
2   3  Aung Aung      Finance  200000
3   4      Ni Ni           HR  150000
4   5   Maung Ba      Finance  205000
5   6  Maung Hla           HR  150000
6   7     Ko Ko            IT  250000
7   8  Kyaw Kyaw   Management  500000
8   8  Kyaw Kyaw   Management  500000
9   8      Su Su   Management  500000

In [31]:
ddf.to_sql('new_employee', conn, if_exists='replace')

10

In [34]:
df

        Name   Department  Salary
0    Win Win  Engineering  500000
1      Ag Ag      Finance  350000
2      Ni Ni           HR  300000
3  Kyaw Kyaw      Finance  350000
4      Bo Bo           HR  300000

In [35]:
df.to_csv('newNextTestFile.csv')

In [38]:
jdf

        Name   Department  Salary
0    Win Win  Engineering  250000
1  Sein Sein           IT  300000
2  Aung Aung      Finance  200000
3      Ni Ni           HR  150000
4   Maung Ba      Finance  205000
5  Maung Hla           HR  155000

In [39]:
jdf.to_json('newJsonFile.json')

## Working with Pandas Dataframe

In [2]:
df = pd.read_csv('covid19.csv')
df.shape

(306429, 8)

In [3]:
df.head()

,SNo,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
1,2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
2,3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
3,4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
4,5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

### Check Null?

In [4]:
df.isnull().sum()

SNo                    0
ObservationDate        0
Province/State     78103
Country/Region         0
Last Update            0
Confirmed              0
Deaths                 0
Recovered              0
dtype: int64

### Remove Null

In [6]:
cdf = df.dropna()
cdf.shape

(228326, 8)

In [7]:
df.shape

(306429, 8)

In [8]:
df.dropna(axis=1, inplace=True)
df.shape

(306429, 7)

In [9]:
df.head()

,SNo,ObservationDate,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
1,2,01/22/2020,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
2,3,01/22/2020,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
3,4,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
4,5,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

### Remove Duplicate

In [10]:
data = {
    'Product': ['Milk', 'Coffee', 'Milk'],
    'Price': [500, 300, 500]
}
temp_df = pd.DataFrame(data)
temp_df

  Product  Price
0    Milk    500
1  Coffee    300
2    Milk    500

In [11]:
temp_df.drop_duplicates(inplace=True)
temp_df

  Product  Price
0    Milk    500
1  Coffee    300

### Replace Null with average values

In [12]:
data = {
    'Product': ['Milk', 'Coffee', 'Milo', 'Tea'],
    'Price': [500, None, 400, 350]
}
tdf = pd.DataFrame(data)
tdf

  Product  Price
0    Milk  500.0
1  Coffee    NaN
2    Milo  400.0
3     Tea  350.0

In [14]:
df_price = tdf['Price']
df_price.describe()

count      3.000000
mean     416.666667
std       76.376262
min      350.000000
25%      375.000000
50%      400.000000
75%      450.000000
max      500.000000
Name: Price, dtype: float64

In [15]:
df_price.mean()

np.float64(416.6666666666667)

In [18]:
avg_price = df_price.mean()
df_price.fillna(avg_price, inplace=True)
tdf

  Product       Price
0    Milk  500.000000
1  Coffee  416.666667
2    Milo  400.000000
3     Tea  350.000000

In [19]:
df.head()

,SNo,ObservationDate,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
1,2,01/22/2020,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
2,3,01/22/2020,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
3,4,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
4,5,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

In [21]:
cv19df = df
conf = cv19df['Confirmed']
conf.head()

0     1.0
1    14.0
2     6.0
3     1.0
4     0.0
Name: Confirmed, dtype: float64

In [22]:
conf = cv19df[['Confirmed']]
conf.head()

   Confirmed
0        1.0
1       14.0
2        6.0
3        1.0
4        0.0

In [23]:
conf.mean()

Confirmed    85670.911559
dtype: float64

In [24]:
cv19df.describe()

                 SNo     Confirmed         Deaths     Recovered
count  306429.000000  3.064290e+05  306429.000000  3.064290e+05
mean   153215.000000  8.567091e+04    2036.403268  5.042029e+04
std     88458.577156  2.775516e+05    6410.938048  2.015124e+05
min         1.000000 -3.028440e+05    -178.000000 -8.544050e+05
25%     76608.000000  1.042000e+03      13.000000  1.100000e+01
50%    153215.000000  1.037500e+04     192.000000  1.751000e+03
75%    229822.000000  5.075200e+04    1322.000000  2.027000e+04
max    306429.000000  5.863138e+06  112385.000000  6.399531e+06

In [25]:
cv19df['Deaths'].describe()

count    306429.000000
mean       2036.403268
std        6410.938048
min        -178.000000
25%          13.000000
50%         192.000000
75%        1322.000000
max      112385.000000
Name: Deaths, dtype: float64

### Group and Count the Rows

In [28]:
country = df['Country/Region'].value_counts()
country

Country/Region
Russia                 30251
US                     26740
Japan                  18059
Mainland China         15758
India                  13182
                       ...
Channel Islands            1
St. Martin                 1
Republic of Ireland        1
Cape Verde                 1
East Timor                 1
Name: count, Length: 229, dtype: int64

In [30]:
country.loc['US']

np.int64(26740)

In [31]:
jdf = cv19df[cv19df['Country/Region'] == 'Japan']
jdf

,SNo,ObservationDate,Country/Region,Last Update,Confirmed,Deaths,Recovered
35,36,01/22/2020,Japan,1/22/2020 17:00,2.0,0.0,0.0
75,76,01/23/2020,Japan,1/23/20 17:00,1.0,0.0,0.0
123,124,01/24/2020,Japan,1/24/20 17:00,2.0,0.0,0.0
166,167,01/25/2020,Japan,1/25/20 17:00,2.0,0.0,0.0
214,215,01/26/2020,Japan,1/26/20 16:00,4.0,0.0,1.0
...,...,...,...,...,...,...,...
306367,306368,05/29/2021,Japan,2021-05-30 04:20:55,8.0,0.0,8.0
306401,306402,05/29/2021,Japan,2021-05-30 04:20:55,2612.0,41.0,2410.0
306413,306414,05/29/2021,Japan,2021-05-30 04:20:55,1963.0,42.0,1692.0
306414,306415,05/29/2021,Japan,2021-05-30 04:20:55,2903.0,60.0,2330.0
306416,306417,05/29/2021,Japan,2021-05-30 04:20:55,1541.0,19.0,1390.0

In [32]:
def situation_function(x):
    if x >= 20:
        return 'bad'
    else:
        return 'normal'
cv19df['Severity'] = cv19df['Confirmed'].apply(situation_function)
cv19df.head(20)

,SNo,ObservationDate,Country/Region,Last Update,Confirmed,Deaths,Recovered,Severity
0,1,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0,normal
1,2,01/22/2020,Mainland China,1/22/2020 17:00,14.0,0.0,0.0,normal
2,3,01/22/2020,Mainland China,1/22/2020 17:00,6.0,0.0,0.0,normal
3,4,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0,normal
4,5,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0,normal
5,6,01/22/2020,Mainland China,1/22/2020 17:00,26.0,0.0,0.0,bad
6,7,01/22/2020,Mainland China,1/22/2020 17:00,2.0,0.0,0.0,normal
7,8,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0,normal
8,9,01/22/2020,Mainland China,1/22/2020 17:00,4.0,0.0,0.0,normal
9,10,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0,normal
10,11,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0,normal
11,12,01/22/2020,Mainland China,1/22/2020 17:00,5.0,0.0,0.0,normal
12,13,01/22/2020,Hong Kong,1/22/2020 17:00,0.0,0.0,0.0,normal
13,14,01/22/2020,Mainland China,1/22/2020 17:00,444.0,17.0,28.0,bad
14,15,01/22/2020,Mainland China,1/22/2020 17:00,4.0,0.0,0.0,normal
15,16,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0,normal
16,17,01/22/2020,Mainland China,1/22/2020 17:00,1.0,0.0,0.0,normal
17,18,01/22/2020,Mainland China,1/22/2020 17:00,2.0,0.0,0.0,normal
18,19,01/22/2020,Mainland China,1/22/2020 17:00,0.0,0.0,0.0,normal
19,20,01/22/2020,Mainland China,1/22/2020 17:00,2.0,0.0,0.0,normal